In [1]:
import pandas as pd

In [2]:
df=pd.read_csv("Book2.csv")

In [3]:
isnull()

NameError: name 'isnull' is not defined

In [4]:
df

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,72,93,74,2023,92,2
1,64,81,60,2020,82,3
2,80,75,80,2024,86,2
3,73,84,64,2020,92,2
4,63,85,66,2021,90,2
...,...,...,...,...,...,...
95,60,80,60,2022,87,2
96,66,92,63,2021,94,2
97,78,77,74,2024,84,3
98,64,88,79,2024,81,3
99,70,89,72,2021,99,2

In [5]:
df.isnull()

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
95,False,False,False,False,False,False
96,False,False,False,False,False,False
97,False,False,False,False,False,False
98,False,False,False,False,False,False
99,False,False,False,False,False,False

In [9]:
series = pd.isnull(df["mathscore"])

In [10]:
df [series]

Empty DataFrame
Columns: [mathscore, reading score, writing score, clubjoin, placement score, placement offer]
Index: []

In [11]:
from sklearn.preprocessing import LabelEncoder

In [12]:
from sklearn.preprocessing import LabelEncoder

In [13]:
df['mathscore'] = le.fit_transform(df['mathscore'])

NameError: name 'le' is not defined

In [14]:
le = LabelEncoder()

In [15]:
df['mathscore'] = le.fit_transform(df['mathscore'])

In [16]:
newdf=df

In [17]:
df

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,12,93,74,2023,92,2
1,4,81,60,2020,82,3
2,19,75,80,2024,86,2
3,13,84,64,2020,92,2
4,3,85,66,2021,90,2
...,...,...,...,...,...,...
95,0,80,60,2022,87,2
96,6,92,63,2021,94,2
97,17,77,74,2024,84,3
98,4,88,79,2024,81,3
99,10,89,72,2021,99,2

In [18]:
isnull()

NameError: name 'isnull' is not defined

In [19]:
df.isnull()

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
95,False,False,False,False,False,False
96,False,False,False,False,False,False
97,False,False,False,False,False,False
98,False,False,False,False,False,False
99,False,False,False,False,False,False

In [20]:
df.notnull()

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,True,True,True,True,True,True
1,True,True,True,True,True,True
2,True,True,True,True,True,True
3,True,True,True,True,True,True
4,True,True,True,True,True,True
...,...,...,...,...,...,...
95,True,True,True,True,True,True
96,True,True,True,True,True,True
97,True,True,True,True,True,True
98,True,True,True,True,True,True
99,True,True,True,True,True,True

In [21]:
ndf=df

In [22]:
df.isnull()

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
95,False,False,False,False,False,False
96,False,False,False,False,False,False
97,False,False,False,False,False,False
98,False,False,False,False,False,False
99,False,False,False,False,False,False

In [23]:
df=pd.read_csv("Book2.csv")

In [24]:
df.isnull()

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,False,True,False,False,False,False
1,False,True,False,False,False,False
2,False,True,False,False,False,False
3,False,True,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
95,False,False,False,False,False,False
96,False,True,False,False,False,False
97,False,True,False,False,False,False
98,False,True,False,False,False,False
99,False,False,False,False,False,False

In [25]:
df

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,72.0,NaN,74.0,2023.0,92,2
1,64.0,NaN,60.0,2020.0,82,3
2,80.0,NaN,80.0,2024.0,86,2
3,73.0,NaN,64.0,2020.0,92,2
4,63.0,93.0,66.0,2021.0,90,2
...,...,...,...,...,...,...
95,60.0,80.0,60.0,2020.0,87,2
96,66.0,NaN,63.0,2020.0,94,2
97,78.0,NaN,74.0,2020.0,84,3
98,64.0,NaN,79.0,2020.0,81,3
99,70.0,89.0,72.0,2020.0,99,2

In [26]:
ndf=df

In [27]:
ndf.fillna(0)

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,72.0,0.0,74.0,2023.0,92,2
1,64.0,0.0,60.0,2020.0,82,3
2,80.0,0.0,80.0,2024.0,86,2
3,73.0,0.0,64.0,2020.0,92,2
4,63.0,93.0,66.0,2021.0,90,2
...,...,...,...,...,...,...
95,60.0,80.0,60.0,2020.0,87,2
96,66.0,0.0,63.0,2020.0,94,2
97,78.0,0.0,74.0,2020.0,84,3
98,64.0,0.0,79.0,2020.0,81,3
99,70.0,89.0,72.0,2020.0,99,2

In [29]:
m_v=df['mathscore'].mean()

In [31]:
df['mathscore'].fillna(value=m_v,inplace=True)

C:\Users\goura\AppData\Local\Temp\ipykernel_6540\765218506.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['mathscore'].fillna(value=m_v,inplace=True)

In [32]:
df

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,72.0,NaN,74.0,2023.0,92,2
1,64.0,NaN,60.0,2020.0,82,3
2,80.0,NaN,80.0,2024.0,86,2
3,73.0,NaN,64.0,2020.0,92,2
4,63.0,93.0,66.0,2021.0,90,2
...,...,...,...,...,...,...
95,60.0,80.0,60.0,2020.0,87,2
96,66.0,NaN,63.0,2020.0,94,2
97,78.0,NaN,74.0,2020.0,84,3
98,64.0,NaN,79.0,2020.0,81,3
99,70.0,89.0,72.0,2020.0,99,2

In [33]:
m_v=df['mathscore'].mean()

In [34]:
df['mathscore'].fillna(value=m_v,inplace=True)

C:\Users\goura\AppData\Local\Temp\ipykernel_6540\765218506.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['mathscore'].fillna(value=m_v,inplace=True)

In [35]:
df['mathscore'] = df['mathscore'].fillna(m_v)

In [36]:
df

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,72.0,NaN,74.0,2023.0,92,2
1,64.0,NaN,60.0,2020.0,82,3
2,80.0,NaN,80.0,2024.0,86,2
3,73.0,NaN,64.0,2020.0,92,2
4,63.0,93.0,66.0,2021.0,90,2
...,...,...,...,...,...,...
95,60.0,80.0,60.0,2020.0,87,2
96,66.0,NaN,63.0,2020.0,94,2
97,78.0,NaN,74.0,2020.0,84,3
98,64.0,NaN,79.0,2020.0,81,3
99,70.0,89.0,72.0,2020.0,99,2

In [38]:
ndf.replace(to_replace = np.NaN, value = -99)

NameError: name 'np' is not defined

In [39]:
import numpy as np

In [40]:
ndf.replace(to_replace = np.NaN, value = -99)

AttributeError: `np.NaN` was removed in the NumPy 2.0 release. Use `np.nan` instead.

In [41]:
ndf.replace(to_replace = np.nan, value = -99)

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,72.0,-99.0,74.0,2023.0,92,2
1,64.0,-99.0,60.0,2020.0,82,3
2,80.0,-99.0,80.0,2024.0,86,2
3,73.0,-99.0,64.0,2020.0,92,2
4,63.0,93.0,66.0,2021.0,90,2
...,...,...,...,...,...,...
95,60.0,80.0,60.0,2020.0,87,2
96,66.0,-99.0,63.0,2020.0,94,2
97,78.0,-99.0,74.0,2020.0,84,3
98,64.0,-99.0,79.0,2020.0,81,3
99,70.0,89.0,72.0,2020.0,99,2

In [42]:
df=pd.read_csv("Book2.csv")

In [43]:
df

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,72.0,NaN,74.0,2023.0,92,2
1,64.0,NaN,60.0,2020.0,82,3
2,80.0,NaN,80.0,2024.0,86,2
3,73.0,NaN,64.0,2020.0,92,2
4,63.0,93.0,66.0,2021.0,90,2
...,...,...,...,...,...,...
95,60.0,80.0,60.0,2020.0,87,2
96,66.0,NaN,63.0,2020.0,94,2
97,78.0,NaN,74.0,2020.0,84,3
98,64.0,NaN,79.0,2020.0,81,3
99,70.0,89.0,72.0,2020.0,99,2

In [44]:
ndf.dropna()

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
4,63.0,93.0,66.0,2021.0,90,2
5,80.0,75.0,65.0,2023.0,98,2
6,62.0,92.0,70.0,2022.0,79,3
7,71.0,79.0,63.0,2023.0,92,2
8,65.0,91.0,69.0,2022.0,97,2
...,...,...,...,...,...,...
92,70.0,81.0,62.0,2020.0,80,3
93,65.0,79.0,78.0,2020.0,95,2
94,80.0,84.0,78.0,2020.0,76,3
95,60.0,80.0,60.0,2020.0,87,2
99,70.0,89.0,72.0,2020.0,99,2

In [45]:
df=pd.read_csv("Book2.csv")

In [46]:
df

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,72.0,NaN,74.0,2023.0,92,2
1,64.0,NaN,60.0,2020.0,82,3
2,80.0,NaN,80.0,NaN,86,2
3,73.0,NaN,64.0,NaN,92,2
4,63.0,93.0,66.0,NaN,90,2
...,...,...,...,...,...,...
95,60.0,80.0,60.0,2020.0,87,2
96,66.0,NaN,63.0,2020.0,94,2
97,78.0,NaN,74.0,2020.0,84,3
98,64.0,NaN,79.0,2020.0,81,3
99,70.0,89.0,72.0,2020.0,99,2

In [47]:
ndf.dropna()

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
4,63.0,93.0,66.0,2021.0,90,2
5,80.0,75.0,65.0,2023.0,98,2
6,62.0,92.0,70.0,2022.0,79,3
7,71.0,79.0,63.0,2023.0,92,2
8,65.0,91.0,69.0,2022.0,97,2
...,...,...,...,...,...,...
92,70.0,81.0,62.0,2020.0,80,3
93,65.0,79.0,78.0,2020.0,95,2
94,80.0,84.0,78.0,2020.0,76,3
95,60.0,80.0,60.0,2020.0,87,2
99,70.0,89.0,72.0,2020.0,99,2

In [48]:
ndf.dropna(how = 'all')

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
0,72.0,NaN,74.0,2023.0,92,2
1,64.0,NaN,60.0,2020.0,82,3
2,80.0,NaN,80.0,2024.0,86,2
3,73.0,NaN,64.0,2020.0,92,2
4,63.0,93.0,66.0,2021.0,90,2
...,...,...,...,...,...,...
95,60.0,80.0,60.0,2020.0,87,2
96,66.0,NaN,63.0,2020.0,94,2
97,78.0,NaN,74.0,2020.0,84,3
98,64.0,NaN,79.0,2020.0,81,3
99,70.0,89.0,72.0,2020.0,99,2

In [49]:
ndf.dropna(axis = 1)

    mathscore  placement score  placement offer
0        72.0               92                2
1        64.0               82                3
2        80.0               86                2
3        73.0               92                2
4        63.0               90                2
..        ...              ...              ...
95       60.0               87                2
96       66.0               94                2
97       78.0               84                3
98       64.0               81                3
99       70.0               99                2

[100 rows x 3 columns]

In [50]:
new_data = ndf.dropna(axis = 0, how ='any')

In [51]:
new_data

,mathscore,reading score,writing score,clubjoin,placement score,placement offer
4,63.0,93.0,66.0,2021.0,90,2
5,80.0,75.0,65.0,2023.0,98,2
6,62.0,92.0,70.0,2022.0,79,3
7,71.0,79.0,63.0,2023.0,92,2
8,65.0,91.0,69.0,2022.0,97,2
...,...,...,...,...,...,...
92,70.0,81.0,62.0,2020.0,80,3
93,65.0,79.0,78.0,2020.0,95,2
94,80.0,84.0,78.0,2020.0,76,3
95,60.0,80.0,60.0,2020.0,87,2
99,70.0,89.0,72.0,2020.0,99,2